In [1]:
import psycopg2
from sqlalchemy import create_engine
import geopandas as gpd
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.animation as animation
import numpy as np
import time
import random
import plotly.express as px

from __future__ import print_function
from ipywidgets import interact, interactive, fixed, interact_manual
from ipywidgets import IntSlider, interact, FloatSlider
import ipywidgets as widgets

from datetime import timedelta

In [2]:
general_path = 'E:/paper2_analysis/traffic_analysis/Omnitrans_denHelder'
figures_path = f'{general_path}/figures'
input_path = f'{general_path}/input'
output_path = f'{general_path}/output'

In [3]:
#name Omnitrans model
model_name = 'ot_denhelder_working_v4_ydbspirdf0'

In [4]:
## connection to postgis DB
alchemyEngine = create_engine(f'postgresql+psycopg2://postgres:postgres@localhost:5432/{model_name}')  
postgreSQLConnection = alchemyEngine.connect();

-----------------------------------

## INITIAL NETWORK _ DRY

In [9]:
## get link typenr

sql = 'SELECT * FROM initial.link2_1data1'
pd.read_sql_query(sql, alchemyEngine)

      linknr  serienr  direction  typenr
0          1        3          1      10
1          1        3          2      10
2          2        3          1      10
3          2        3          2      10
4          4        3          1      10
...      ...      ...        ...     ...
3809    3367        3          2       1
3810    2061        3          2      14
3811    2061        3          1      14
3812    1804        3          1      12
3813    1804        3          2      12

[3814 rows x 4 columns]

In [8]:
## update voor iedere tijdsinterval.

#variant maken per tijd.

In [ ]:
#link maken met flood links en linnkr


#if linknr is in flooded_links
    #then typenr - naar flooded

In [10]:
flooded_links_test = [1804, 1963]

#### make connection with psycopg2

In [31]:
conn = psycopg2.connect(
   database="ot_denhelder_working_v4_ydbspirdf0",
    user='postgres', 
    password='postgres', 
    host='localhost', 
    port= '5432'
)

conn.autocommit = True

cursor = conn.cursor()

#### update

In [48]:
linknr_update = 2062
sql = f'UPDATE T1.link2_1data1 \
                SET typenr = 99 \
                WHERE linknr = {linknr_update}'
cursor.execute(sql)

In [50]:
linknr_update = 2062
sql = f'UPDATE T1.link3_1data1 \
                SET freespeed = 10, \
                satflow = 10,\
                speedatcap = 5\
                WHERE linknr = {linknr_update}'
cursor.execute(sql)

#### check of het is aangepast

In [49]:
sql = 'SELECT * FROM T1.link2_1data1'
linktype_data = pd.read_sql_query(sql, alchemyEngine)
linktype_data[linktype_data.linknr == linknr_update]

      linknr  serienr  direction  typenr
3812    2062        3          1      99
3813    2062        3          2      99

In [51]:
sql = 'SELECT * FROM T1.link3_1data1'
linktype_data = pd.read_sql_query(sql, alchemyEngine)
linktype_data[linktype_data.linknr == linknr_update]

,linknr,mode,time,direction,speed,capacity,freespeed,satflow,speedatcap
11436,2062,10,10,1,10.0,1200.0,10.0,10.0,5.0
11437,2062,10,10,2,10.0,1200.0,10.0,10.0,5.0
11438,2062,10,20,1,10.0,1200.0,10.0,10.0,5.0
11439,2062,10,20,2,10.0,1200.0,10.0,10.0,5.0
11440,2062,10,1000,1,10.0,1200.0,10.0,10.0,5.0
11441,2062,10,1000,2,10.0,1200.0,10.0,10.0,5.0